Revit 2026 API

# BuiltInFailuresGlobalParameterFailures Class

---

SystemObject Autodesk.Revit.DBBuiltInFailuresGlobalParameterFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class GlobalParameterFailures
```
```vb
Public NotInheritable Class GlobalParameterFailures
```
```cpp
public ref class GlobalParameterFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type GlobalParameterFailures = class end
```

The BuiltInFailuresGlobalParameterFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ElementPropLinkCircularChain | Linked properties in highlighted elements cause a circular chain of references. |
|  | ElementPropLinkCircularChainError | Linked properties in highlighted elements cause a circular chain of references. |
|  | GlobalParamFormulaCircularChain | A formula in a global parameter causes a circular chain of references between highlighted elements. |
|  | GlobalParamFormulaCircularChainError | A formula in a global parameter causes a circular chain of references between highlighted elements. |
|  | GlobalParamInvalidElemParamValue | Invalid value of parameter %1!s! in highlighted element. |
|  | InvalidElementPropToGlobalParamLink | The following parameters of the highlighted element can no longer be linked to global parameters: %1!s!. |

#### Reference

Autodesk.Revit.DB Namespace